Revit 2024 API
FaceDetailNode.GetInstanceTransform Method
 Returns instance transform of the object being drawn.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2020
Syntax
C#
public Transform GetInstanceTransform()
Visual Basic
Public Function GetInstanceTransform As Transform
Visual C++
public:
Transform^ GetInstanceTransform()
See Also
FaceDetailNode Class
Autodesk.Revit.DB Namespace